duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/nb/nb.c
		if((fds.revents & POLLNVAL) == POLLNVAL)
		{
		#ifdef NB_DEBUG
			LOGD("POLLNVAL");
		#endif
			break;
		}
	}
#ifdef NB_DEBUG	
	LOGD("Disconnecting MQTT client...");
#endif

	err = mqtt_disconnect(&client);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Could not disconnect MQTT client. Error: %d", err);
	#endif
	}

	mqtt_connecting_flag = false;
}

static void SendDataCallBack(struct k_timer *timer)
{
	send_data_flag = true;
}

static void NbSendDataStart(void)
{
	k_timer_start(&send_data_timer, K_MSEC(100), K_NO_WAIT);
}

static void NbSendDataStop(void)
{
	k_timer_stop(&send_data_timer);
}

static void NbSendData(void)
{
	uint8_t *p_data;
	uint32_t data_len;
	int ret;

	ret = get_data_from_send_cache(&p_data, &data_len);
	if(ret)
	{
		ret = data_publish(&client, MQTT_QOS_1_AT_LEAST_ONCE, p_data, data_len);
		if(!ret)
		{
			delete_data_from_send_cache();
		}

		k_timer_start(&send_data_timer, K_MSEC(500), K_NO_WAIT);
	}
}

bool MqttIsConnected(void)
{
#ifdef NB_DEBUG
	LOGD("mqtt_connected:%d", mqtt_connected);
#endif
	return mqtt_connected;
}

void DisConnectMqttLink(void)
{
	int err;
		
	if(k_timer_remaining_get(&mqtt_disconnect_timer) > 0)
		k_timer_stop(&mqtt_disconnect_timer);

	if(mqtt_connected)
	{
		err = mqtt_disconnect(&client);
		if(err)
		{
		#ifdef NB_DEBUG
			LOGD("Could not disconnect MQTT client. Error: %d", err);
		#endif
		}
		
		mqtt_connected = false;
	}
}

void DisconnectAppMqttLink(void)
{
	if(k_timer_remaining_get(&mqtt_disconnect_timer) > 0)
		k_timer_stop(&mqtt_disconnect_timer);

	if(mqtt_connected)
	{
		mqtt_connected = false;
		mqtt_disconnect_flag = true;
	}
}

static void MqttDisConnect(void)
{
	int err;

#ifdef NB_DEBUG
	LOGD("begin");
#endif
	err = mqtt_disconnect(&client);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Could not disconnect MQTT client. Error: %d", err);
	#endif
	}
}

static void MqttDisConnectCallBack(struct k_timer *timer_id)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif
	mqtt_disconnect_flag = true;
}

static void MqttDicConnectStart(void)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif
	k_timer_start(&mqtt_disconnect_timer, K_SECONDS(MQTT_CONNECTED_KEEP_TIME), K_NO_WAIT);
}

static void MqttDicConnectStop(void)
{
	k_timer_stop(&mqtt_disconnect_timer);
}


/**@brief Callback handler for LTE RSRP data. */
static void modem_rsrp_handler(char rsrp_value)
{
	/* RSRP raw values that represent actual signal strength are
	 * 0 through 97 (per "nRF91 AT Commands" v1.1). If the received value
	 * falls outside this range, we should not send the value.
	 */
#ifdef NB_DEBUG
	LOGD("rsrp_value:%d", rsrp_value);
#endif
	g_rsrp = rsrp_value;
	nb_redraw_sig_flag = true;
}

#ifdef CONFIG_MODEM_INFO
/**brief Initialize LTE status containers. */
void modem_data_init(void)
{
	int err;

	err = modem_info_init();
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Modem info could not be established: %d", err);
	#endif
		return;
	}

	modem_info_params_init(&modem_param);
	modem_info_rsrp_register(modem_rsrp_handler);
}
#endif /* CONFIG_MODEM_INFO */

/**@brief Configures modem to provide LTE link. Blocks until link is
 * successfully established.
 */
static void modem_configure(void)
{
	if(test_nb_flag)
	{
		strcpy(nb_test_info, "modem_configure");
		TestNBUpdateINfor();
	}

	//if(at_cmd_write("AT%CESQ=1", NULL, 0, NULL) != 0)
	if(nrf_modem_at_cmd(NULL, 0, "AT%CESQ=1") != 0)
	{
	#ifdef NB_DEBUG
		LOGD("AT_CMD write fail!");
	#endif
	}

#if defined(CONFIG_LTE_LINK_CONTROL)
	if (IS_ENABLED(CONFIG_LTE_AUTO_INIT_AND_CONNECT))
	{
		/* Do nothing, modem is already turned on
		 * and connected.
		 */
	}
	else
	{
	#if defined(CONFIG_LWM2M_CARRIER)
		/* Wait for the LWM2M_CARRIER to configure the modem and
		 * start the connection.
		 */
	#ifdef NB_DEBUG
		LOGD("Waitng for carrier registration...");
	#endif
		if(test_nb_flag)
		{
			strcpy(nb_test_info, "Waitng for carrier registration...");
			TestNBUpdateINfor();
		}
		k_sem_take(&carrier_registered, K_FOREVER);
	#ifdef NB_DEBUG
		LOGD("Registered!");
	#endif
		if(test_nb_flag)
		{
			strcpy(nb_test_info, "Registered!");
			TestNBUpdateINfor();
		}
	#else /* defined(CONFIG_LWM2M_CARRIER) */
		int err;
	#ifdef NB_DEBUG
		LOGD("LTE Link Connecting ...");
	#endif
		if(test_nb_flag)
		{
			strcpy(nb_test_info, "LTE Link Connecting ...");
			TestNBUpdateINfor();
		}
		err = lte_lc_init_and_connect();
		__ASSERT(err == 0, "LTE link could not be established.");
	#ifdef NB_DEBUG
		LOGD("LTE Link Connected!");
	#endif
		if(test_nb_flag)
		{
			strcpy(nb_test_info, "LTE Link Connected!");
			TestNBUpdateINfor();
			k_timer_start(&get_nw_rsrp_timer, K_MSEC(1000), K_NO_WAIT);
		}
	#endif /* defined(CONFIG_LWM2M_CARRIER) */
	}
#endif /* defined(CONFIG_LTE_LINK_CONTROL) */
}

void test_nb(void)
{
	test_nb_on = true;
}

void MenuStartNB(void)
{
	test_nb_on = true;
}

void MenuStopNB(void)
{
	nb_is_running = false;
	test_nb_flag = false;

	if(k_timer_remaining_get(&get_nw_rsrp_timer) > 0)
		k_timer_stop(&get_nw_rsrp_timer);
}

void NBGetNetMode(uint8_t *at_mode_set)
{
	uint8_t *p1,*p2;
	uint8_t tmpbuf[8] = {0};
	
	p1 = strstr(at_mode_set, "AT%XSYSTEMMODE");
	if(p1 != NULL)
	{
		p1 += strlen("AT%XSYSTEMMODE");
		p2 = strstr(p1, ",");
		if(p2 != NULL)
		{
			p1 = p2+1;
			p2 = strstr(p1, ",");
			if(p2 != NULL)
			{
				memcpy(tmpbuf, p1, p2-p1);
				if(atoi(tmpbuf) == 1)
					g_net_mode = NET_MODE_NB;
				else
					g_net_mode = NET_MODE_LTE_M;
			}
		}
	}
}

void NBRedrawNetMode(void)
{
	if(screen_id == SCREEN_ID_IDLE)
	{
		scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_NET_MODE;
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
	}
}

void NBRedrawSignal(void)
{
	uint8_t *ptr;
	bool flag=false;
	uint8_t strbuf[128] = {0};
	uint8_t tmpbuf[128] = {0};

	//if(at_cmd_write(CMD_GET_REG_STATUS, strbuf, sizeof(strbuf), NULL) == 0)
	if(nrf_modem_at_cmd(strbuf, sizeof(strbuf), CMD_GET_REG_STATUS) == 0)
	{
		//+CEREG: <n>,<stat>[,[<tac>],[<ci>],[<AcT>][,<cause_type>],[<reject_cause>][,[<Active-Time>],[<Periodic-TAU>]]]]
		//<n>
		//	0 ¨C Disable unsolicited result codes
		//	1 ¨C Enable unsolicited result codes +CEREG:<stat>
		//	2 ¨C Enable unsolicited result codes +CEREG:<stat>[,<tac>,<ci>,<AcT>]
		//	3 ¨C Enable unsolicited result codes +CEREG:<stat>[,<tac>,<ci>,<AcT>[,<cause_type>,<reject_cause>]]
		//	4 ¨C Enable unsolicited result codes +CEREG: <stat>[,[<tac>],[<ci>],[<AcT>][,,[,[<Active-Time>],[<Periodic-TAU>]]]]
		//	5 ¨C Enable unsolicited result codes +CEREG: <stat>[,[<tac>],[<ci>],[<AcT>][,[<cause_type>],[<reject_cause>][,[<ActiveTime>],[<Periodic-TAU>]]]]
		//<stat>
		//	0 ¨C Not registered. UE is not currently searching for an operator to register to.
		//	1 ¨C Registered, home network.
		//	2 ¨C Not registered, but UE is currently trying to attach or searching an operator to register to.
		//	3 ¨C Registration denied.
		//	4 ¨C Unknown (e.g. out of E-UTRAN coverage).
		//	5 ¨C Registered, roaming.
		//	8 ¨C Attached for emergency bearer services only.
		//	90 ¨C Not registered due to UICC failure.
		//<tac>
		//	String. A 2-byte Tracking Area Code (TAC) in hexadecimal format.
		//<ci>
		//	String. A 4-byte E-UTRAN cell ID in hexadecimal format.
		//<AcT>
		//	7 ¨C E-UTRAN
		//	9 ¨C E-UTRAN NB-S1
		//<cause_type>
		//	0 ¨C <reject_cause> contains an EPS Mobility Management (EMM) cause value. See 3GPP TS 24.301 Annex A.
		//<reject_cause>
		//	EMM cause value. See 3GPP TS 24.301 Annex A
		//<Active-Time>
		//	String. One byte in an 8-bit format.
		//	Indicates the Active Time value (T3324) allocated to the device in E-UTRAN. For the coding and value range, see the GPRS Timer 2 IE in 3GPP TS 24.008 Table 10.5.163/3GPP TS 24.008.
		//<Periodic-TAU>
		//	String. One byte in an 8-bit format.
		//	Indicates the extended periodic TAU value (T3412) allocated to the device in EUTRAN. For the coding and value range, see the GPRS Timer 3 IE in 3GPP TS 24.008 Table 10.5.163a/3GPP TS 24.008.
		uint8_t *ptr;
		uint8_t reg_status;
		
