duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/nb/nb.c
			//ºóÌ¨ÏÂ·¢Ð£Ê±Ö¸Áî
			//timezone
			ptr = strstr(strdata, ",");
			if(ptr == NULL)
				return;
			copylen = (ptr-strdata) < sizeof(tz_buf) ? (ptr-strdata) : sizeof(tz_buf);
			memcpy(tz_buf, strdata, copylen);
			if(tz_buf[0] == '+' || tz_buf[0] == '-')
			{
				if(tz_buf[0] == '+')
					tz_dir = 1;
				else
					tz_dir = 0;

				tz_count = atoi(&tz_buf[1]);
			}
			else
			{
				tz_dir = 1;
				tz_count = atoi(tz_buf);
			}

		#ifdef NB_DEBUG
			LOGD("timezone:%c%d",  (tz_dir == 1 ? '+':'-'), tz_count);
		#endif

			//date
			ptr++;
			ptr1 = strstr(ptr, ",");
			if(ptr1 == NULL)
				return;
			copylen = (ptr1-ptr) < sizeof(date_buf) ? (ptr1-ptr) : sizeof(date_buf);
			memcpy(date_buf, ptr, copylen);
			memset(tmpbuf, 0, sizeof(tmpbuf));
			memcpy(tmpbuf, &date_buf[0], 4);
			tmp_dt.year = atoi(tmpbuf);
			memset(tmpbuf, 0, sizeof(tmpbuf));
			memcpy(tmpbuf, &date_buf[4], 2);
			tmp_dt.month = atoi(tmpbuf);
			memset(tmpbuf, 0, sizeof(tmpbuf));
			memcpy(tmpbuf, &date_buf[6], 2);
			tmp_dt.day = atoi(tmpbuf);

			//time
			ptr = ptr1+1;
			copylen = (datalen-(ptr-strdata)) < sizeof(time_buf) ? (datalen-(ptr-strdata)) : sizeof(time_buf);
			memcpy(time_buf, ptr, copylen);
			memset(tmpbuf, 0, sizeof(tmpbuf));
			memcpy(tmpbuf, &time_buf[0], 2);
			tmp_dt.hour = atoi(tmpbuf);
			memset(tmpbuf, 0, sizeof(tmpbuf));
			memcpy(tmpbuf, &time_buf[2], 2);
			tmp_dt.minute = atoi(tmpbuf);
			memset(tmpbuf, 0, sizeof(tmpbuf));
			memcpy(tmpbuf, &time_buf[4], 2);
			tmp_dt.second = atoi(tmpbuf);

			//if(tz_dir == 1)
			//{
			//	TimeIncrease(&tmp_dt, tz_count*15);
			//}
			//else
			//{
			//	TimeDecrease(&tmp_dt, tz_count*15);
			//}
			
		#ifdef NB_DEBUG
			LOGD("%04d%02d%02d %02d:%02d:%02d", tmp_dt.year,tmp_dt.month,tmp_dt.day,tmp_dt.hour,tmp_dt.minute,tmp_dt.second);
		#endif

			if(CheckSystemDateTimeIsValid(tmp_dt))
			{
				tmp_dt.week = GetWeekDayByDate(tmp_dt);
				memcpy(&date_time, &tmp_dt, sizeof(sys_date_timer_t));
				RedrawSystemTime();
				SaveSystemDateTime();

				server_has_timed_flag = true;
			}

			flag = true;			
		}

		SaveSystemSettings();

		if(flag)
		{			
			strcmd[0] = 'T';
			NBSendSettingReply(strcmd, strlen(strcmd));
		}
	}
}

static void ParseDataCallBack(struct k_timer *timer_id)
{
	parse_data_flag = true;
}

static void ParseReceData(void)
{
	uint8_t *p_data;
	uint32_t data_len;
	int ret;

	ret = get_data_from_rece_cache(&p_data, &data_len);
	if(ret)
	{
		ParseData(p_data, data_len);
		delete_data_from_rece_cache();
		
		k_timer_start(&parse_data_timer, K_MSEC(100), K_NO_WAIT);
	}
}

static void ParseReceDataStart(void)
{
	k_timer_start(&parse_data_timer, K_MSEC(500), K_NO_WAIT);
}

static void MqttReceData(uint8_t *data, uint32_t datalen)
{
	int ret;

	ret = add_data_into_rece_cache(data, datalen);
#ifdef NB_DEBUG
	LOGD("data add ret:%d", ret);
#endif
	ParseReceDataStart();
}

static int configure_low_power(void)
{
	int err;

#if defined(CONFIG_LTE_PSM_ENABLE)&&!defined(NB_SIGNAL_TEST)
	/** Power Saving Mode */
	err = lte_lc_psm_req(true);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("lte_lc_psm_req, error: %d", err);
	#endif
	}
#else
	err = lte_lc_psm_req(false);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("lte_lc_psm_req, error: %d", err);
	#endif
	}
#endif

#if defined(CONFIG_LTE_EDRX_ENABLE)&&!defined(NB_SIGNAL_TEST)
	/** enhanced Discontinuous Reception */
	err = lte_lc_edrx_req(true);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("lte_lc_edrx_req, error: %d", err);
	#endif
	}
#else
	err = lte_lc_edrx_req(false);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("lte_lc_edrx_req, error: %d", err);
	#endif
	}
#endif

#if defined(CONFIG_LTE_RAI_ENABLE)
	/** Release Assistance Indication  */
	//err = at_cmd_write(CMD_SET_RAI, NULL, 0, NULL);
	err = nrf_modem_at_cmd(NULL, 0, CMD_SET_RAI);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("lte_lc_rai_req, error: %d", err);
	#endif
	}
#endif

	return err;
}

void GetModemSignal(void)
{
	char *ptr1,*ptr2;
	int i=0,len;
	uint8_t strbuf[64] = {0};
	uint8_t tmpbuf[64] = {0};
	int32_t rsrq=0,rsrp,snr;
	static int32_t rsrpbk = 0;
	
	//if(at_cmd_write(CMD_GET_CESQ, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_CESQ) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("%s", tmpbuf);
	#endif
		len = strlen(tmpbuf);
		ptr1 = tmpbuf;
		while(i<4)
		{
			ptr1 = strstr(ptr1, ",");
			ptr1++;
			i++;
		}
		//rsrq
		ptr2 = strstr(ptr1, ",");
		memcpy((char*)strbuf, ptr1, ptr2-ptr1);
		rsrq = atoi(strbuf);
		//rsrp
		ptr2++;
		memset(strbuf, 0, sizeof(strbuf));
		memcpy((char*)strbuf, ptr2, len-(ptr2-(char*)tmpbuf));
		rsrp = atoi(strbuf);
	}

	//if(at_cmd_write(CMD_GET_SNR, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_SNR) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("%s", tmpbuf);
	#endif
		ptr1 = tmpbuf+9;
		ptr2 = strstr(ptr1, ",");
		memcpy((char*)strbuf, ptr1, ptr2-ptr1);
		snr = atoi(strbuf);
	}

	if(test_nb_flag)
	{
		sprintf(nb_test_info, " snr:%d(%ddB)\nrsrq:%d(%0.1fdB)\nrsrp:%d(%ddBm)", snr,(snr-24),rsrq,(rsrq/2-19.5),rsrp,(rsrp-141));
		nb_test_update_flag = true;
	}
	else
	{
		if(rsrp != rsrpbk)
		{
			rsrpbk = rsrp;
			modem_rsrp_handler(rsrp);
		}
	}
}

static void GetNetWorkTimeCallBack(struct k_timer *timer_id)
{
	get_modem_time_flag = true;
}

static void GetModemInforCallBack(struct k_timer *timer_id)
{
	get_modem_info_flag = true;
}

static void NBReconnectCallBack(struct k_timer *timer_id)
{
	nb_reconnect_flag = true;
}

static void GetNetWorkSignalCallBack(struct k_timer *timer_id)
{
	get_modem_signal_flag = true;
}

static void GetModemStatusCallBack(struct k_timer *timer_id)
{
	get_modem_status_flag = true;
}

void DecodeModemMonitor(uint8_t *buf, uint32_t len)
{
	uint8_t reg_status = 0;
	uint8_t *ptr;
	uint8_t tmpbuf[128] = {0};
	uint8_t strbuf[128] = {0};

	if(buf == NULL || len == 0)
		return;

#ifdef NB_DEBUG	
	LOGD("%s", buf);
#endif
	//%XMONITOR: 1,"","","46000","1D29",9,8,"0D1E2D42",11,3684,45,38,"","00000100","11100000","00111110"
	ptr = strstr(buf, "%XMONITOR: ");
	if(ptr)
	{
		//²¹ÉÏÒ»¸ö¶ººÅ×÷ÎªÄ©Î²µÄ·Ö¸ô·û,Ìæ»»ÒÔÇ°µÄ0x0d,0x0a
		buf[len-2] = ',';
		buf[len-1] = 0x00;
		//Ö¸ÁîÍ·
		ptr += strlen("%XMONITOR: ");
		//reg_status
		GetStringInforBySepa(ptr, ",", 1, tmpbuf);
		reg_status = atoi(tmpbuf);
		//0 ¨C Not registered. UE is not currently searching for an operator to register to.
		//1 ¨C Registered, home network.
		//2 ¨C Not registered, but UE is currently trying to attach or searching an operator to register to.
		//3 ¨C Registration denied.
		//4 ¨C Unknown (e.g. out of E-UTRAN coverage).
		//5 ¨C Registered, roaming.
		//8 ¨C Attached for emergency bearer services only.
		//90 ¨C Not registered due to UICC failure.
		if(reg_status == 1 || reg_status == 5)
		{
			uint8_t tau = 0;
			uint8_t act = 0;
			uint16_t flag;

