duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/nb/nb.c
			g_nw_registered = true;

		#if 0
			//full name
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 2, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("full name:%s", tmpbuf);
		#endif
			//short name
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 3, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("short name:%s", tmpbuf);
		#endif
			//plmn
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 4, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("plmn:%s", tmpbuf);
		#endif
			//tac
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 5, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("tac:%s", tmpbuf);
		#endif
			//AcT
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 6, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("AcT:%s", tmpbuf);
		#endif
			//band
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 7, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("band:%s",  tmpbuf);
		#endif
			//cell_id
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 8, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("cell_id:%s", tmpbuf);
		#endif
			//phys_cell_id
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 9, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("phys_cell_id:%s", tmpbuf);
		#endif
			//EARFCN
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 10, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("EARFCN:%s", tmpbuf);
		#endif
		#endif	
			//rsrp
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 11, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("rsrp:%s", tmpbuf);
		#endif
			g_rsrp = atoi(tmpbuf);
			modem_rsrp_handler(g_rsrp);
		#if 0	
			//snr
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 12, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("snr:%s", tmpbuf);
		#endif
			//NW-provided_eDRX_value
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 13, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("NW-provided_eDRX_value:%s", tmpbuf);
		#endif
		#endif
			//Active-Time
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 14, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("Active-Time:%s", tmpbuf);
		#endif
			memcpy(strbuf, &tmpbuf[1], 8);
			act = (strbuf[0]-0x30)*0x80+(strbuf[1]-0x30)*0x40+(strbuf[2]-0x30)*0x20;
			switch(act>>5)
			{
			case 0://0 0 0 ¨C value is incremented in multiples of 2 seconds
				flag = 2;
				break;
			case 1://0 0 1 ¨C value is incremented in multiples of 1 minute
				flag = 60;
				break;
			case 2://0 1 0 ¨C value is incremented in multiples of 6 minutes
				flag = 6*60;
				break;
			case 3://0 1 1 ¨C value indicates that the timer is deactivated
				flag = 0;
				break;
			}
			g_act_time = flag*((strbuf[3]-0x30)*0x10+(strbuf[4]-0x30)*0x08+(strbuf[5]-0x30)*0x04+(strbuf[6]-0x30)*0x02+(strbuf[7]-0x30)*0x01);
		#ifdef NB_DEBUG
			LOGD("g_act_time:%d", g_act_time);
		#endif
			//Periodic-TAU-ext
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 15, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("Periodic-TAU-ext:%s", tmpbuf);
		#endif
			memcpy(strbuf, &tmpbuf[1], 8);
			act = (strbuf[0]-0x30)*0x80+(strbuf[1]-0x30)*0x40+(strbuf[2]-0x30)*0x20;
			switch(act>>5)
			{
			case 0://0 0 0 ¨C value is incremented in multiples of 10 minutes
				flag = 10*60;
				break;
			case 1://0 0 1 ¨C value is incremented in multiples of 1 hour
				flag = 60*60;
				break;
			case 2://0 1 0 ¨C value is incremented in multiples of 10 hours
				flag = 10*60*60;
				break;
			case 3://0 1 1 ¨C value is incremented in multiples of 2 seconds
				flag = 2;
				break;
			case 4://1 0 0 ¨C value is incremented in multiples of 30 seconds
				flag = 30;
				break;
			case 5://1 0 1 ¨C value is incremented in multiples of 1 minute
				flag = 60;
				break;
			case 6://1 1 0 ¨C value is incremented in multiples of 320 hours
				flag = 320*60*60;
				break;
			case 7://1 1 1 ¨C value indicates that the timer is deactivated
				flag = 0;
				break;
			}
			g_tau_ext_time = flag*((strbuf[3]-0x30)*0x10+(strbuf[4]-0x30)*0x08+(strbuf[5]-0x30)*0x04+(strbuf[6]-0x30)*0x02+(strbuf[7]-0x30)*0x01);
		#ifdef NB_DEBUG
			LOGD("g_tau_ext_time:%d", g_tau_ext_time);
		#endif
			//Periodic-TAU
			memset(tmpbuf, 0, sizeof(tmpbuf));
			GetStringInforBySepa(ptr, ",", 16, tmpbuf);
		#ifdef NB_DEBUG
			LOGD("Periodic-TAU:%s", tmpbuf);
		#endif
			memset(strbuf,0,sizeof(strbuf));
			memcpy(strbuf, &tmpbuf[1], 8);
			tau = (strbuf[0]-0x30)*0x80+(strbuf[1]-0x30)*0x40+(strbuf[2]-0x30)*0x20;
			switch(tau>>5)
			{
			case 0://0 0 0 ¨C value is incremented in multiples of 2 seconds
				flag = 2;
				break;
			case 1://0 0 1 ¨C value is incremented in multiples of 1 minute
				flag = 60;
				break;
			case 2://0 1 0 ¨C value is incremented in multiples of 6 minute
				flag = 6*60;
				break;
			case 7://1 1 1 ¨C value indicates that the timer is deactivated
				flag = 0;
				break;
			}
			g_tau_time = flag*((strbuf[3]-0x30)*0x10+(strbuf[4]-0x30)*0x08+(strbuf[5]-0x30)*0x04+(strbuf[6]-0x30)*0x02+(strbuf[7]-0x30)*0x01);
		#ifdef NB_DEBUG
			LOGD("g_tau_time:%d", g_tau_time);
		#endif
		}
		else
		{
			g_nw_registered = false;
			nb_connected = false;
			g_rsrp = 255;
			modem_rsrp_handler(g_rsrp);
		}
	}
}

void SetNetWorkApn(uint8_t *imsi_buf)
{
	uint32_t i;
	uint8_t tmpbuf[256] = {0};

	for(i=0;i<ARRAY_SIZE(nb_apn_table);i++)
	{
		if(strncmp(imsi_buf, nb_apn_table[i].plmn, strlen(nb_apn_table[i].plmn)) == 0)
		{
			uint8_t cmdbuf[128] = {0};
			
			sprintf(cmdbuf, "AT+CGDCONT=0,\"IP\",\"%s\"", nb_apn_table[i].apn);
		#ifdef NB_DEBUG
			LOGD("cmdbuf:%s", cmdbuf); 
		#endif
			//if(at_cmd_write(cmdbuf, tmpbuf, sizeof(tmpbuf), NULL) != 0)
			if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), cmdbuf) != 0)
			{
			#ifdef NB_DEBUG
				LOGD("set apn fail!");
			#endif
			}

			break;
		}
	}

	//if(at_cmd_write(CMD_GET_APN, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_APN) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("apn:%s", tmpbuf); 
	#endif
	}
}

void SetNwtWorkMqttBroker(uint8_t *imsi_buf)
{
	if(strncmp(imsi_buf, "460", strlen("460")) == 0)
	{
		strcpy(broker_hostname, CONFIG_MQTT_DOMESTIC_BROKER_HOSTNAME);
		broker_port = CONFIG_MQTT_DOMESTIC_BROKER_PORT;
	}
	else
	{
		strcpy(broker_hostname, CONFIG_MQTT_FOREIGN_BROKER_HOSTNAME);
		broker_port = CONFIG_MQTT_FOREIGN_BROKER_PORT;
	}
}

