duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/nb/nb.c
/*static void at_handler(void *context, const char *response)
{
	ARG_UNUSED(context);

	int err;
	enum lte_lc_nw_reg_status status;

	if(response == NULL)
		return;

	err = parse_nw_reg_status(response, &status, AT_CEREG_REG_STATUS_INDEX);
	if(err)
		return;

	if((status == LTE_LC_NW_REG_REGISTERED_HOME) ||
	    (status == LTE_LC_NW_REG_REGISTERED_ROAMING))
	{
		k_sem_give(&net_link);
	}
}*/

static bool is_cellid_valid(uint32_t cellid)
{
	if (cellid == LTE_LC_CELL_EUTRAN_ID_INVALID) {
		return false;
	}

	return true;
}

static void at_handler_cereg(const char *response)
{
	int err;
	struct lte_lc_evt evt = {0};

	__ASSERT_NO_MSG(response != NULL);

	static enum lte_lc_nw_reg_status prev_reg_status =
		LTE_LC_NW_REG_NOT_REGISTERED;
	static struct lte_lc_cell prev_cell;
	static struct lte_lc_psm_cfg prev_psm_cfg;
	static enum lte_lc_lte_mode prev_lte_mode = LTE_LC_LTE_MODE_NONE;
	enum lte_lc_nw_reg_status reg_status = 0;
	struct lte_lc_cell cell = {0};
	enum lte_lc_lte_mode lte_mode;
	struct lte_lc_psm_cfg psm_cfg = {0};

	LOGD("+CEREG notification: %s", log_strdup(response));

	err = parse_cereg(response, true, &reg_status, &cell, &lte_mode);
	if (err) {
		LOGD("Failed to parse notification (error %d): %s",
			err, log_strdup(response));
		return;
	}

	if ((reg_status == LTE_LC_NW_REG_REGISTERED_HOME) ||
	    (reg_status == LTE_LC_NW_REG_REGISTERED_ROAMING)) {
		/* Set the network registration status to UNKNOWN if the cell ID is parsed
		 * to UINT32_MAX (FFFFFFFF) when the registration status is either home or
		 * roaming.
		 */
		if (!is_cellid_valid(cell.id)) {
			reg_status = LTE_LC_NW_REG_UNKNOWN;
		} else {
			k_sem_give(&net_link);
		}
	}

	switch (reg_status) {
	case LTE_LC_NW_REG_NOT_REGISTERED:
		LTE_LC_TRACE(LTE_LC_TRACE_NW_REG_NOT_REGISTERED);
		break;
	case LTE_LC_NW_REG_REGISTERED_HOME:
		LTE_LC_TRACE(LTE_LC_TRACE_NW_REG_REGISTERED_HOME);
		break;
	case LTE_LC_NW_REG_SEARCHING:
		LTE_LC_TRACE(LTE_LC_TRACE_NW_REG_SEARCHING);
		break;
	case LTE_LC_NW_REG_REGISTRATION_DENIED:
		LTE_LC_TRACE(LTE_LC_TRACE_NW_REG_REGISTRATION_DENIED);
		break;
	case LTE_LC_NW_REG_UNKNOWN:
		LTE_LC_TRACE(LTE_LC_TRACE_NW_REG_UNKNOWN);
		break;
	case LTE_LC_NW_REG_REGISTERED_ROAMING:
		LTE_LC_TRACE(LTE_LC_TRACE_NW_REG_REGISTERED_ROAMING);
		break;
	case LTE_LC_NW_REG_REGISTERED_EMERGENCY:
		LTE_LC_TRACE(LTE_LC_TRACE_NW_REG_REGISTERED_EMERGENCY);
		break;
	case LTE_LC_NW_REG_UICC_FAIL:
		LTE_LC_TRACE(LTE_LC_TRACE_NW_REG_UICC_FAIL);
		break;
	}

	if (event_handler_list_is_empty()) {
		return;
	}

	/* Network registration status event */
	if (reg_status != prev_reg_status) {
		prev_reg_status = reg_status;
		evt.type = LTE_LC_EVT_NW_REG_STATUS;
		evt.nw_reg_status = reg_status;

		event_handler_list_dispatch(&evt);
	}

	/* Cell update event */
	if (memcmp(&cell, &prev_cell, sizeof(struct lte_lc_cell))) {
		evt.type = LTE_LC_EVT_CELL_UPDATE;

		memcpy(&prev_cell, &cell, sizeof(struct lte_lc_cell));
		memcpy(&evt.cell, &cell, sizeof(struct lte_lc_cell));
		event_handler_list_dispatch(&evt);
	}

	if (lte_mode != prev_lte_mode) {
		prev_lte_mode = lte_mode;
		evt.type = LTE_LC_EVT_LTE_MODE_UPDATE;
		evt.lte_mode = lte_mode;

		LTE_LC_TRACE(lte_mode == LTE_LC_LTE_MODE_LTEM ?
			     LTE_LC_TRACE_LTE_MODE_UPDATE_LTEM :
			     LTE_LC_TRACE_LTE_MODE_UPDATE_NBIOT);

		event_handler_list_dispatch(&evt);
	}

	if ((reg_status != LTE_LC_NW_REG_REGISTERED_HOME) &&
	    (reg_status != LTE_LC_NW_REG_REGISTERED_ROAMING)) {
		return;
	}

	err = lte_lc_psm_get(&psm_cfg.tau, &psm_cfg.active_time);
	if (err) {
		LOGD("Failed to get PSM information");
		return;
	}

	/* PSM configuration update event */
	if (memcmp(&psm_cfg, &prev_psm_cfg, sizeof(struct lte_lc_psm_cfg))) {
		evt.type = LTE_LC_EVT_PSM_UPDATE;

		memcpy(&prev_psm_cfg, &psm_cfg, sizeof(struct lte_lc_psm_cfg));
		memcpy(&evt.psm_cfg, &psm_cfg, sizeof(struct lte_lc_psm_cfg));
		event_handler_list_dispatch(&evt);
	}
}



static int net_connect(void)
{
	int err, rc;
	const char *current_network_mode = nw_mode_preferred;
	bool retry;

	k_sem_init(&net_link, 0, 1);

	//rc = at_notif_register_handler(NULL, at_handler);
        rc = at_monitor_resume(ltelc_atmon_cereg_info);
	if(rc != 0)
		return rc;

	do
	{
		retry = false;

		//if(at_cmd_write(current_network_mode, NULL, 0, NULL) != 0)
		if(nrf_modem_at_cmd(NULL, 0, current_network_mode) != 0)
		{
			err = -EIO;
			goto exit;
		}

		NBGetNetMode(current_network_mode);

		//if(at_cmd_write(normal, NULL, 0, NULL) != 0)
		if(nrf_modem_at_cmd(NULL, 0, normal) != 0)
		{
			err = -EIO;
			goto exit;
		}

		err = k_sem_take(&net_link, K_SECONDS(CONFIG_LTE_NETWORK_TIMEOUT));
		if(err == -EAGAIN)
		{
		#ifdef NB_DEBUG
			LOGD("Network connection attempt timed out");
		#endif

			if(IS_ENABLED(CONFIG_LTE_NETWORK_USE_FALLBACK)&&(current_network_mode == nw_mode_preferred))
			{
				current_network_mode = nw_mode_fallback;
				retry = true;

				//if(at_cmd_write(offline, NULL, 0, NULL) != 0)
				if(nrf_modem_at_cmd(NULL, 0, offline) != 0)
				{
					err = -EIO;
					goto exit;
				}
			#ifdef NB_DEBUG
				LOGD("Using fallback network mode");
			#endif
			}
			else
			{
				err = -ETIMEDOUT;
			}
		}
	}while(retry);

exit:
	//rc = at_notif_deregister_handler(NULL, at_handler);
        rc = at_monitor_pause(ltelc_atmon_cereg_info);
	if(rc != 0)
	{
	#ifdef NB_DEBUG
		LOGD("Can't de-register handler rc=%d", rc);
	#endif
	}

	return err;
}

static int net_init_and_link(void)
{
	int ret;

	ret = lte_lc_init();
	if(ret)
	{
		return ret;
	}

	return net_connect();
}

static void nb_link(struct k_work *work)
{
	int err=0;
	uint8_t tmpbuf[128] = {0};
	static uint32_t retry_count = 0;
	static bool frist_flag = false;

#ifndef NB_SIGNAL_TEST
	if(!frist_flag)
	{
		frist_flag = true;
		GetModemInfor();
		SetModemTurnOff();
		SetNetWorkParaByPlmn(g_imsi);
	}
	else if(strlen(g_imsi) == 0)
	{
		SetModemTurnOn();
		GetModemInfor();
		SetModemTurnOff();
		SetNetWorkParaByPlmn(g_imsi);
	}

	if(strlen(g_imsi) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("Can't get sim info, cancel the connecting!");
	#endif
		return;
	}
#endif

	/*if(gps_is_working())
	{
	#ifdef NB_DEBUG
		LOGD("gps is working, continue waiting!");
	#endif
	
		if(retry_count <= 2)		//2æ¬¡ä»¥å†…æ¯1åˆ†é’Ÿé‡è¿žä¸€ï¿
			k_timer_start(&nb_reconnect_timer, K_SECONDS(60), K_NO_WAIT);
		else if(retry_count <= 4)	//3ï¿½æ¬¡ï¿½åˆ†é’Ÿé‡è¿žä¸€ï¿
			k_timer_start(&nb_reconnect_timer, K_SECONDS(300), K_NO_WAIT);
		else if(retry_count <= 6)	//5ï¿½æ¬¡ï¿½åˆ†é’Ÿé‡è¿žä¸€ï¿
			k_timer_start(&nb_reconnect_timer, K_SECONDS(600), K_NO_WAIT);
		else if(retry_count <= 8)	//7ï¿½æ¬¡ï¿½å°æ—¶é‡è¿žä¸€ï¿
			k_timer_start(&nb_reconnect_timer, K_SECONDS(3600), K_NO_WAIT);
		else						//8æ¬¡ä»¥ä¸Šæ¯6å°æ—¶é‡è¿žä¸€ï¿
			k_timer_start(&nb_reconnect_timer, K_SECONDS(6*3600), K_NO_WAIT);	
	}
	else
	{*/
	#ifdef NB_DEBUG
		LOGD("linking");
	#endif
	
		nb_connecting_flag = true;
		configure_low_power();
		err = net_init_and_link();
		if(err)
		{
		#ifdef NB_DEBUG
			LOGD("Can't connected to LTE network. err:%d", err);
		#endif
		
		#ifdef CONFIG_SYNC_SUPPORT
			SyncNetWorkCallBack(SYNC_STATUS_FAIL);
		#endif

			nb_connected = false;

			retry_count++;
			if(retry_count <= 2)		//2æ¬¡ä»¥å†…æ¯1åˆ†é’Ÿé‡è¿žä¸€ï¿
				k_timer_start(&nb_reconnect_timer, K_SECONDS(60), K_NO_WAIT);
			else if(retry_count <= 4)	//3ï¿½æ¬¡ï¿½åˆ†é’Ÿé‡è¿žä¸€ï¿
				k_timer_start(&nb_reconnect_timer, K_SECONDS(300), K_NO_WAIT);
			else if(retry_count <= 6)	//5ï¿½æ¬¡ï¿½åˆ†é’Ÿé‡è¿žä¸€ï¿
				k_timer_start(&nb_reconnect_timer, K_SECONDS(600), K_NO_WAIT);
			else if(retry_count <= 8)	//7ï¿½æ¬¡ï¿½å°æ—¶é‡è¿žä¸€ï¿
				k_timer_start(&nb_reconnect_timer, K_SECONDS(3600), K_NO_WAIT);
			else						//8æ¬¡ä»¥ä¸Šæ¯6å°æ—¶é‡è¿žä¸€ï¿
				k_timer_start(&nb_reconnect_timer, K_SECONDS(6*3600), K_NO_WAIT);
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("Connected to LTE network");
		#endif
		
